print("国当てゲームへようこそ。問題は10問です。ヒントは1つの国につき3回まで表示されます。それでは、頑張って下さい。")
print("難易度を選択してください: ")
print("1. 簡単")
print("2. 普通")
print("3. 難しい")

#難易度選択
difficulty = input("難易度を半角で入力して下さい (1,2,or 3):")

if difficulty not in ["1", "2", "3"]:
    print("エラー: 無効な難易度が選択されました。1, 2, 3のいずれかを選択してください。")

#ヒントリスト
countries = [
    {
        "country":"カナダ",
        "hints":{
            "1":["北米の国","国旗にカエデの葉がある","ナイアガラの滝が有名"],
            "2":["イギリスの植民地だった","最大都市はトロント","ロッキー山脈がまたがっている"],
            "3":["速度制限の表記はMAXIMUM","公用語が２つある","オバマ元米国大統領が使っていたスマホ、ブラックベリーの本部がある"]
        }
    },
    {
        "country":"アメリカ",
        "hints":{
             "1":["最大都市はニューヨーク","名門ハーバード大学がある","2021年に就任した大統領はバイデン"],
             "2":["南北戦争が勃発","世界一の軍事力を誇る","大統領専用車の名前はビースト"],
             "3":["鼻をすするのはマナー違反とされる","独立記念日は７月４日","農地の割合は約40%"],
        }
    },
    {
        "country":"トルコ",
        "hints":{
            "1":["首都はアンカラ","ヨーロッパとアジアをまたがっている","国旗に三日月と星がある"],
            "2":["アヤソフィアなど、世界遺産が多数","通貨はリラ","最大都市はイスタンブール"],
            "3":["クルディスタンがまたがっている","紀元前１世紀、コンマゲネ王国が存在した","2024年現在の大統領はエルドアン"],
        }
    },
    {
        "country":"スウェーデン",
        "hints":{
            "1":["北欧の国","首都はストックホルム","国旗に青が使われている"],
            "2":["通貨はクローナ","世界的な福祉国家","隣国はフィンランドとノルウェー"],
            "3":["H&M,Spotifyの本部がある","ノーベル賞の授与式が行われている","移民の受け入れが多い"],
        }
    },
    {
        "country":"中国",
        "hints":{
            "1":["首都は北京","日本と地理的に近い","2024年の人口は約14億人"],
            "2":["尖閣諸島問題がある","辛さが特徴の料理がある","少子化が進んでいる"],
            "3":["伝統的な結婚式がある","1911年、革命が起こった","ポタラ宮など観光名所が多数"],
        }
    },
    {   
        "country":"シンガポール",
        "hints":{
            "1":["マーライオンが有名","東南アジアにある","国旗に赤が使われている"],
            "2":["都市国家","マレーシアから独立","ガムを持ち込むと罰金になる"],
            "3":["公用語は4つある","ラッフルズが上陸した","配車はGrab"],
        }
    },
    {
        "country":"イギリス",
        "hints":{
            "1":["首都はロンドン","本初子午線が通る","料理がまずいと言われている"],
            "2":["EUを離脱した","ハリーポッターのロケ地がある","略すとUK"],
            "3":["蒸気機関車が発明された","EFTAを結成した","ノルマン人に侵攻された歴史がある"],
        }
    },
    {
        "country":"ドイツ",
        "hints":{
            "1":["首都はベルリン","メルセデスベンツなど、世界的な自動車メーカーの本部がある","EUに加盟している"],
            "2":["欧州中央銀行がある","シンデレラ城のモデルとなった城がある","2024年のGDPは世界3位"],
            "3":["ハンザ同盟の盟主となった都市がある","「〇〇のヒロシマ」と呼ばれたドレスデンがある","ヘッセン州は経済の中心地"],
        }
    },
    {
        "country":"イタリア",
        "hints":{
            "1":["首都はローマ","ヨーロッパにある国","パスタが美味しい"],
            "2":["コロッセウムが有名","国土の中に独立国がある","フランスと国境を接している"],
            "3":["オーバーツーリズムで入場料がかかるようになった都市がある","政府間機関ICCROMの本部がある","人口は約6000万人"],
        }
    },
    {
        "country":"エジプト",
        "hints":{
            "1":["首都はカイロ","アフリカの国","ピラミッドが有名"],
            "2":["公用語はアラビア語","ナイル川が流れている","太陽暦の起源"],
            "3":["カタールと断交したことがある","運河の通行料が収入源の一つ","ユネスコから遺跡救済キャンペーンを受けたことがある"],
        }
    }
]

#カウント
correct_answers = 0

#問題
for item in countries:
    print("\n出題国はこちら！")

    hints = item["hints"][difficulty]

    #ヒント
    for hint in hints:
            print("ヒント:", hint)
            answer = input("国名を入力してください: ")

            #判定
            if answer == item["country"]:
                print("すごい！正解です！")
                correct_answers += 1
                break  #次の国へ
            else:
                print("違います！")

    else:
            print(f"残念！正解は「{item['country']}」でした。")

print(f"\nゲーム終了！正解数は {correct_answers} / {len(countries)} でした。お疲れ様でしたー！")
